// Дан двумерный массив чисел n * m в котором каждая строка и каждый столбец идут по увеличеннию.
// Также дано число k. Нужно найти число k в матрице и если число найдено вернуть true, иначе false.
// arr = [
// [1, 4, 7, 11, 15, 16],
// [2, 5, 8, 12, 19, 22],
// [3, 6, 9, 16, 22, 24],
// [10, 13, 14, 17, 24, 27],
// [18, 21, 23, 26, 30, 36],
// ]
// Input: k = 14
// Output: true

// Вариант 1
// Время O(n + m)
// Память O(1)

const matrix = [
  [1, 4, 7, 11, 15, 16],
  [2, 5, 8, 12, 19, 22],
  [3, 6, 9, 16, 22, 24],
  [10, 13, 14, 17, 24, 27],
  [18, 21, 23, 26, 30, 36],
];

const findNumberInMatrix = (matrix, k) => {
  let row = matrix.length - 1;
  let col = 0;

  while (row >= 0 && col < matrix[0].length) {
    if (matrix[row][col] == k) {
      return true;
    } else if (matrix[row][col] > k) {
      row--;
    } else {
      col++;
    }
  }
  return false;
};